Revit 2026 API

# EdgeEndPointEvaluate Method

---

Evaluate the end point of the edge in 3d coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Evaluate()
```
```vb
Public Function Evaluate As XYZ
```
```cpp
public:
XYZ^ Evaluate()
```
```fsharp
member Evaluate : unit -> XYZ
```

#### Return Value

XYZ The end point of the edge in 3d coordinates.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Failed to evaluate the end point of the edge. |

#### Reference

EdgeEndPoint Class

Autodesk.Revit.DB Namespace